3. Розв’яжіть з підручника [A3] з глави 9 (Chapter 9, starting from page 384)
задачі (Programming Exercises): 9.1, 9.7, 9.8, 9.10.
3.1. Клас, що вимагається розробити, та тестовий клас розмістіть у одному
файлі. Тестовий клас та файл, у якому він розміщений, назвіть іменем
Ex03_5_T, де T – номер задачі (наприклад, 9_1, 9_7 тощо); таким чином,
тестовий клас програми, у якій розв’язується задача 9.1, повинен мати
ім’я Ex03_5_9_1.
3.2. На початку файлу з кодом у коментарі вкажіть своє прізвище та ім’я.
4. Розв’яжіть з підручника [M2] з глави 3 (Chapter 3, starting from page 171)
задачі (Exercises): 5, 6, 7, 12, 14.
4.1. На початку файлу з кодом у коментарі вкажіть своє прізвище та ім’я.
5. Розв’яжіть з підручника [M2] з глави 4 (Chapter 4, starting from page 234)
задачі (Exercises): 2, 4, 6, 11.
5.1. Задачу 11 адаптуйте для України, тобто, замість штатів використовуйте
області нашої держави, в якості міст – обласні центри тощо.
5.2. На початку файлу з кодом у коментарі вкажіть своє прізвище та ім’я.

Увага! Отримані у пп. 3, 4, 5 поточного завдання файли з вихідними кодами
(java-файли) заархівуйте та прикріпіть у Classroom як відповідь на завдання.