# Болібрук В.Ю.
# 3. Дано масив a , що містить n дійсних чисел. Отримайте масив b з n дійсних
# чисел, у якому кожний елемент bi є середнім арифметичним усіх елементів
# масиву a , окрім елементу ai . Формула середнього арифметичного для
# масиву елементів подана у попередній задачі.
# 4. Дано масиви x та y , кожний з яких містить по n дійсних чисел. Отримайте
# суму добутків відповідних елементів масивів, тобто, отримати 
# xi yi .5. Дано масиви a та b, кожний з яких містить по n дійсних чисел. Отримайте
# значення наступного виразу:
# a1  bn a2  bn2 ...an  b1


import numpy as np

x = np.array([1, 2, 3])
y = np.array([1,2,3])

# обчислюємо суму добутків відповідних елементів масивів x та y
result = np.sum(x * y)

print('result 5b arr\n', result)
