# coding: cp1251
# Болібрук В.Ю.

# 3. Дано масив a , що містить n дійсних чисел. Отримайте масив b з n дійсних
# чисел, у якому кожний елемент bi є середнім арифметичним усіх елементів
# масиву a , окрім елементу ai . Формула середнього арифметичного для
# масиву елементів подана у попередній задачі.
# 4. Дано масиви x та y , кожний з яких містить по n дійсних чисел. Отримайте
# суму добутків відповідних елементів масивів, тобто, отримати 
# xi yi .5. Дано масиви a та b, кожний з яких містить по n дійсних чисел. Отримайте
# значення наступного виразу:
# a1  bn a2  bn2 ...an  b1

import numpy as np


# створюємо масив a з n дійсних чисел
a = [1, 2, 3, 4, 5]
# створюємо порожній масив b довжиною n
b = [0] * len(a)
# проходимо по кожному елементу масиву a
for i in range(len(a)):
    # видаляємо i-тий елемент з масиву a
    ai = a.pop(i)
    # обчислюємо середнє арифметичне залишкового масиву
    avg = sum(a) / len(a)
    # повертаємо i-тий елемент в масив a
    a.insert(i, ai)
    # присвоюємо i-му елементу масиву b отримане середнє арифметичне
    b[i] = avg

print('result 5a arr\n', b)
