# coding: cp1251
# Дано масив a , що містить n дійсних чисел: a1, a2 , …, an . Розташуйте
# елементи масиву у наступному порядку:
# а) an , a1, a2 , …, an1;
# б) a1, a3 , a5 , …, a2 , a4 , …. Тобто, спочатку розмістіть елементи з непарними
# індексами, потім елементи з парними індексами;
# в) спочатку елементи другої половини масиву у тому ж порядку, як у
# початковому масиві, потім елементи першої половини масиву у тому ж
# порядку, як у початковому масиві. Якщо кількість елементів масиву
# непарна, то друга частина масиву повинна мати на 1 елемент більше
import numpy as np

arr = np.random.randint(1, 101, size=9)
print('init arr\n', arr)
# print('last element\n', arr[-1])
# a)
# print('init arr\n', arr)
a = np.concatenate(([arr[-1]], arr[:-1]))
print('result 4a arr\n', a)

# b)
arr_sorted = np.concatenate((np.sort(arr[arr%2==1]), np.sort(arr[arr%2==0])))
print('result 4b arr\n', arr_sorted)

# c)
midpoint = len(arr) // 2
c = np.concatenate((arr[midpoint-1:],arr[:midpoint]))
print('result 4c arr\n', c)


# 3. Дано масив a , що містить n дійсних чисел. Отримайте масив b з n дійсних
# чисел, у якому кожний елемент bi є середнім арифметичним усіх елементів
# масиву a , окрім елементу ai . Формула середнього арифметичного для
# масиву елементів подана у попередній задачі.
# 4. Дано масиви x та y , кожний з яких містить по n дійсних чисел. Отримайте
# суму добутків відповідних елементів масивів, тобто, отримати 
# xi yi .5. Дано масиви a та b, кожний з яких містить по n дійсних чисел. Отримайте
# значення наступного виразу:
# a1  bn a2  bn2 ...an  b1



# створюємо масив a з n дійсних чисел
a = [1, 2, 3, 4, 5]
# створюємо порожній масив b довжиною n
b = [0] * len(a)
# проходимо по кожному елементу масиву a
for i in range(len(a)):
    # видаляємо i-тий елемент з масиву a
    ai = a.pop(i)
    # обчислюємо середнє арифметичне залишкового масиву
    avg = sum(a) / len(a)
    # повертаємо i-тий елемент в масив a
    a.insert(i, ai)
    # присвоюємо i-му елементу масиву b отримане середнє арифметичне
    b[i] = avg

print('result 5a arr\n', b)



x = np.array([1, 2, 3, 4, 5])
y = np.array([6, 7, 8, 9, 10])

# обчислюємо суму добутків відповідних елементів масивів x та y
result = np.sum(x * y)

print('result 5b arr\n', b)
