# coding: cp1251
# Болібрук В.Ю.
# Дано масив a , що містить n дійсних чисел: a1, a2 , …, an . Розташуйте
# елементи масиву у наступному порядку:
# а) an , a1, a2 , …, an1;
# б) a1, a3 , a5 , …, a2 , a4 , …. Тобто, спочатку розмістіть елементи з непарними
# індексами, потім елементи з парними індексами;
# в) спочатку елементи другої половини масиву у тому ж порядку, як у
# початковому масиві, потім елементи першої половини масиву у тому ж
# порядку, як у початковому масиві. Якщо кількість елементів масиву
# непарна, то друга частина масиву повинна мати на 1 елемент більше
import numpy as np

a = [1, 2, 3]
b =  [1 , 2, 3]
mult = 1
# проходимо по кожному елементу масиву a
for i in range(len(a)):
    lastel = len(a) -1 -i 
    mult =  mult * (a[i]+b[lastel])


print('result 5c arr\n', mult)
